// GET - Метод GET запрашивает представление ресурса. Запросы с использованием этого метода могут только извлекать данные.
//
// HEAD - HEAD запрашивает ресурс так же, как и метод GET, но без тела ответа.
//
// POST - POST используется для отправки сущностей к определённому ресурсу. Часто вызывает изменение состояния или какие-то побочные эффекты на сервере.
//
// PUT - PUT заменяет все текущие представления ресурса данными запроса.
//
// DELETE - DELETE удаляет указанный ресурс.
//
// CONNECT - CONNECT устанавливает "туннель" к серверу, определённому по ресурсу.
//
// OPTIONS - OPTIONS используется для описания параметров соединения с ресурсом.
//
// TRACE - TRACE выполняет вызов возвращаемого тестового сообщения с ресурса.
//
// PATCH - PATCH используется для частичного изменения ресурса.
