// let year = prompt('В каком году была опубликована спецификация ECMAScript-2015?', '');
//
// if (year == 2015) alert( 'Вы правы!' );
//
// if (year == 2015) {
//   alert( "Правильно!" );
//   alert( "Вы такой умный!" );
// }
//
// let year = prompt('В каком году была опубликована спецификация ECMAScript-2015?', '');
//
// if (year == 2015) {
//   alert( 'Да вы знаток!' );
// } else {
//   alert( 'А вот и неправильно!' ); // любое значение, кроме 2015
// }
//
// let year = prompt('В каком году была опубликована спецификация ECMAScript-2015?', '');
//
// if (year < 2015) {
//   alert( 'Это слишком рано...' );
// } else if (year > 2015) {
//   alert( 'Это поздновато' );
// } else {
//   alert( 'Верно!' );
// }

// let result = условие ? значение1 : значение2;
// let accessAllowed = (age > 18) ? true : false;
