// -- while --
// while (condition) {
//   // код
//   // также называемый "телом цикла"
// }
//
// let i = 0;
// while (i < 3) { // выводит 0, затем 1, затем 2
//   alert( i );
//   i++;
// }

// -- do while --
// do {
//   // тело цикла
// } while (condition);
//
// let i = 0;
// do {
//   alert( i );
//   i++;
// } while (i < 3);

// -- for --
// for (начало; условие; шаг) {
//   // ... тело цикла ...
// }
//
// for (let i = 0; i < 3; i++) { // выведет 0, затем 1, затем 2
//   alert(i);
// }

// Любая часть for может быть пропущена.
// for (;;) {
//   // будет выполняться вечно
// }
